package day07;

public class ArrayMethodEx1 {

	public static void main(String[] args) {
		//1~45사이의 중복되지 않은 랜덤한 수 6개를 만드는 코드를 작성하시오.(메소드 이용)
		
		//1~45사이의 중복되지 않은 수 6개를 입력하는 코드를 작성하시오.(메소드 이용)
	}

	/* 기능 : min ~max 사이의 중복되지 않은 랜덤한 수를 배열에 만들어 주고 생성 여부를 알려주는 메소드
	 * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : 
	 * */
	
	//[1, 2, 0, 0, 0] -> 배열에서 0번지부터 2개 중에서 0과 일치하는 값이 있나? false
	/* 기능 : 배열이 주어지고 배열의 0번지부터 n개 중에서 num와 같은 값이 있는지 없는지를 알려주는 메소드
	 * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : 
	 * */
		
	/* min ~ max 사이의 랜덤한 수를 생성해서 알려주는 메소드
	 * 매개변수 : 
	 * 리턴타입 : 
	 * 메소드명 : */
}

