package day10.word;

public class WordMainManual {
	/* 영어 단어장 프로그램을 만드세요.
	 * 제한사항
	 * 각 알파벳(A~C) 마다 5단어만 구현
	 * 단어의 뜻은 최대 2개 까지 작성 가능
	 * 
	 * 1. 기능 정리
	 * 	1. 알파벳별 단어장
	 * 		-모르는 단어는 체크해서 북마크
	 * 	2. 단어 추가하기
	 * 		-뜻 최대 2개 까지 작성
	 * 	3. 북마크 단어 보기
	 * 		-북마크 해제
	 * 	
	 * 
	 * 2. 틀 작성
	 * [영어 단어장]
	 * 1. 알파벳별 단어장
	 * 2. 단어 추가하기
	 * 3. 북마크 단어 보기
	 * 4. 종료
	 * 메뉴 선택 : 1
	 * 
	 * [알파벳별 단어장]
	 * 1. a
	 * 2. b
	 * 3. c
	 * 4. 뒤로가기
	 * 알파벳 선택 : 1
	 * 
	 * [A]
	 * attak : 폭행, 공격
	 * 엔터
	 * advance : 전진, 발전
	 * 엔터
	 * arm : 팔
	 * 엔터
	 * age : 나이, 연령
	 * 엔터
	 * art : 미술, 예술
	 * 엔터
	 * 
	 * [알파벳별 단어장]
	 * 1. a
	 * 2. b
	 * 3. c
	 * 4. 뒤로가기
	 * 알파벳 선택 : 2
	 * 
	 * [B]
	 * back : 등, 허리
	 * 엔터
	 * bar : 술집
	 * 엔터
	 * box : 상자
	 * 엔터
	 * bag : 봉투, 가방
	 * 엔터
	 * bowl : 그릇, 통
	 * 엔터
	 * 
	 * [알파벳별 단어장]
	 * 1. a
	 * 2. b
	 * 3. c
	 * 4. 뒤로가기
	 * 알파벳 선택 : 3
	 * 
	 * [C]
	 * charge : 요금
	 * 엔터
	 * crown : 왕관
	 * 엔터
	 * cup : 컵
	 * 엔터
	 * cap : 모자
	 * 엔터
	 * crop : 농작물, 수확량
	 * 엔터
	 * 
	 * 
	 * [영어 단어장]
	 * 1. 알파벳별 단어장
	 * 2. 단어 추가하기
	 * 3. 북마크 단어 보기
	 * 4. 종료
	 * 메뉴 선택 : 2
	 * 
	 * [단어 추가하기]
	 * *a로 시작되는 단어는 A에 추가 ...
	 * 
	 * [영어 단어장]
	 * 1. 알파벳별 단어장
	 * 2. 단어 추가하기
	 * 3. 북마크 단어 보기
	 * 4. 종료
	 * 메뉴 선택 : 3
	 * 
	 * [북마크 단어 보기]
	 *  *체크한 단어만 보이게 하기
	 * 
	 * 
	 * 
	 * 
	 * 
	 *  /////////////////////
	 *  [영어 단어장]
	 * 1. 알파벳별 단어장
	 * 2. 단어 추가하기
	 * 3. 북마크 단어 보기
	 * 4. 단어 맞추기 게임
	 * 5. 종료
	 * 메뉴 선택 : 4
	 * 
	 * [단어 맞추기 게임] *랜덤으로 나옴
	 * attack
	 * 1) 단어 뜻 입력 : 폭행
	 * 정답
	 * 2) 단어 뜻 입력 : 공격
	 * 정답
	 * 3) 단어 뜻 입력 : 폭행, 공격 or 공격, 폭행
	 * 정답
	 * 4) 단어 뜻 입력 : 다른 뜻이 들어가면
	 * 땡!
	 * 
	 * 3. 필요 메소드 구현
	 * */
}
