package day09.board;

public class CheckUpManual {

	public static void main(String[] args) {

		/* 게시판에서 게시글 관리를 위한 콘솔 프로그램 작성하세요.
		 * 건강검진 사이트
		 * 1. 검진사이트 소개 - 검진회사 소개
		 * 2. 검진 종류 - 1. 일반검진 2. 특수검진(가격)
		 * 3. 표준 임상수치 검색 - 검색을 통해 해당 검사 수치의 기본값을 검색되게 함
		 * (1. 간기능 : 총단백, 알부민, AST, ALT, ALP / 
		 * 2. 콜레스테롤 : 총콜레스테롤, HDL-ch, LDL-ch, 중성지방 / 
		 * 3. 당뇨검사 : 공복혈당, 당화혈색소)
		 * 
		 * 4. 검사결과 확인 - 5명 배열로 해서 각 다른 아이디에 수치 저장
		 * 
		 * -제한사항 정리
		 * 본인 생년월일을 쳐야 검사결과 확인가능
		 *
		 *===============================
		 *
		 * 1. 필요한 기능을 정리해서 메뉴로 출력
		 * [KH 검진센터]
		 * 1. 검진사이트 소개
		 * 2. 검진 종류
		 * 3. 표준 임상수치 검색
		 * 4. 검사결과 확인
		 * 5. 사이트 나가기
		 * 메뉴 선택 : 1
		 * 
		 * [검진사이트 소개]
		 * 공단검진과 특수검진이 가능한 검진센터 입니다.
		 * 
		 * [KH 검진센터]
		 * 1. 검진사이트 소개
		 * 2. 검진 종류
		 * 3. 표준 임상수치 검색
		 * 4. 검사결과 확인
		 * 메뉴 선택 : 2
		 * 
		 * [검진 종류]
		 * 1. 일반 검진
		 * 2. 특수 검진
		 * 메뉴 선택 : 1
		 * 
		 * [일반 검진]
		 * 신체계측, 혈압, 시력, 청력(1000Hz), 채혈, 흉부촬영검사, 소변검사(stick 5종), 구강검사를 하는 일반검진 입니다.
		 * 매 2년마다 1회 실시(비사무직은 매년 실시)
		 * [검진 종류]
		 * 1. 일반 검진
		 * 2. 특수 검진
		 * 메뉴 선택 : 2
		 * 
		 * [특수 검진]
		 * 일반 검진에서 추가하여 청력(1000~4000Hz), 심전도 검사, 폐활량 검사를 추가로 검사하는 특수검진 입니다.
		 * [검진 종류]
		 * 1. 일반 검진
		 * 2. 특수 검진
		 * 메뉴 선택 : 3
		 * 
		 * [KH 검진센터]
		 * 1. 검진사이트 소개
		 * 2. 검진 종류
		 * 3. 표준 임상수치 검색
		 * 4. 검사결과 확인
		 * 메뉴 선택 : 3
		 * 
		 * [표준 임상수치 검색]
		 * 1. 간기능(총단백, 알부민, AST, ALT, ALP)
		 * 2. 콜레스테롤(총콜레스테롤, HDL-ch, LDL-ch, 중성지방)
		 * 3. 당뇨검사(공복혈당, 당화혈색소)
		 * 메뉴 선택 : 1
		 * [간기능]
		 * 1. 총단백 : 6.0-8.3g/dl
		 * 2. 알부민 : 3.5-5.2g/dl
		 * 3. AST : 0-32IU/L
		 * 4. ALT : 0-34IU/L
		 * 5. ALP : 40-150IU/L
		 * 
		 * 메뉴 선택 : 2
		 * [콜레스테롤]
		 * 1. 총콜레스테롤 : 120-199mg/dl
		 * 2. HDL-콜레스테롤 : 40-60mg/dl
		 * 3. LDL-콜레스테롤 : 50-129mg/dl
		 * 4. 중성지방 : 50-149mg/dl
		 * 
		 * 메뉴 선택 : 3
		 * [당뇨검사]
		 * 1. 공복혈당 : 70-99mg/dl
		 * 2. 당화혈색소 : 4.4-6.4%
		 * 
		 * [KH 검진센터]
		 * 1. 검진사이트 소개
		 * 2. 검진 종류
		 * 3. 표준 임상수치 검색
		 * 4. 검사결과 확인
		 * 메뉴 선택 : 4
		 * 
		 * [검사결과 확인]
		 * 생년월일 6자리 입력 : 981009
		 * 
		 * 981009님의 검사결과 입니다.
		 * [간기능]
		 * 1. 총단백 : 
		 * 2. 알부민 : 
		 * 3. AST : 
		 * 4. ALT : 
		 * 5. ALP : 
		 * 
		 * [콜레스테롤]
		 * 1. 총콜레스테롤 : 
		 * 2. HDL-콜레스테롤 : 
		 * 3. LDL-콜레스테롤 : 
		 * 4. 중성지방 : 
		 * 
		 * [당뇨검사]
		 * 1. 공복혈당 : 
		 * 2. 당화혈색소 : 
		 * 
		 * 2. 기능을 구현*/
	}

}
