package day04;

public class txt {

	/* 반복문
		-while문
		-조건식에 따라 한번도 실행되지 않을 수 있다.
		while(조건식) {
			실행문;
		}
		
		-for문
		-조건식에 따라 한번도 실행되지 않을 수 있다.
		for(초기화;조건식;증감식) {
			실행문;
		}
		
		-do while문
		-최소 한번은 실행
		do {
			실행문;
		}while(조건식);
		
		-break문
		-반복문을 빠져 나가는 코드
		
		-continue문
		-반복문에서 특정 위치로 이동하는 코드(스킵)
		
		-라벨링
		A : for( ; ; ) { //1
		
			for( ; ;) { //2
				if() {
					break A;	//원래는 2for문을 빠져나가지만, A 라벨링을하면 Afor문을 빠져나간다.
				}
			}
		}
		
		반복문 문제를 풀때
		1. 반복횟수 => 초기화, 조건식, 증감식을 결정
		2. 규칙성 => 실행문
*/
}
